tutorials/Coupled/2D_example_steady_PNPNS_half/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss linear;
    div(U)	        Gauss linear;
    div(phi,U)      Gauss linear;

/*
    div(phiE, cPlus)    Gauss linear;
    div(phiE, cMinus)   Gauss linear;
    div(z1gradPhiSUf,C1) Gauss linear;
    div(z2gradPhiSUf,C2) Gauss linear;
    div(z1gradPhiSf,C1) Gauss linear;
    div(z2gradPhiSf,C2) Gauss linear;
    div(phiDimless,C1) Gauss linear;
    div(phiDimless,C2) Gauss linear;
    div(D1z1gradPhiSUf,C1) Gauss linear;
    div(D2z2gradPhiSUf,C2) Gauss linear;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
*/
}

laplacianSchemes
{
    default         Gauss linear corrected;   
    laplacian(-DimlessD1,C1) Gauss linear corrected;
    laplacian(-DimlessD2,C2) Gauss linear corrected;
    laplacian(Phi) Gauss linear corrected;
    laplacian(z1C1f,Phi) Gauss linear limited 0.5;
    laplacian(z2C2f,Phi) Gauss linear limited 0.5;
    laplacian(nu,U) Gauss linear corrected;
    laplacian(-DimlD1,C1) Gauss linear corrected;
    laplacian(-DimlD2,C2) Gauss linear corrected;
    laplacian(D1z1C1f,Phi) Gauss linear corrected;
    laplacian(D2z2C2f,Phi) Gauss linear corrected;
    laplacian(rAU,p) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    interpolate(C1) linear;
    interpolate(C2) linear;
    interpolate(U)  linear;
}

snGradSchemes
{
    default         corrected;
    snGrad(Phi)     corrected;
    snGrad(C1)      corrected;
    snGrad(C2)      corrected;
}


// ************************************************************************* //
